csi-induction_3D/openfoam_template_steady_3D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss skewCorrected linear corrected;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss skewCorrected linearUpwind grad(U);
    div(phi,T)      Gauss skewCorrected linear;
    div(phi,k)      Gauss skewCorrected linear;
    div(phi,epsilon) Gauss skewCorrected linear;
    div((nuEff*dev2(T(grad(U))))) Gauss skewCorrected linear;
    
}

laplacianSchemes
{
    default         Gauss skewCorrected linear corrected;
}

interpolationSchemes
{
    default         skewCorrected linear;
    // flux(U)         linear;
    // interpolate(rAU)  linear;
    // interpolate(((alphaEff*Cp0)*rho0))  linear;
    // dotInterpolate(S,U_0)  linear;
    // flux(HbyA)      linear;
}

snGradSchemes //corrected, faceCorrected, limited, linearFit, orthogonal, quadraticFit, uncorrected
{
    default         corrected;
}


// ************************************************************************* //
