csi-induction_3D/openfoam_template_steady_3D/system/elmerToFoamDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system";
    object      elmerToFoamDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

coordinatePermut    (0 1 2); // (x,y,z) -> (x,z,y)

coordStartColumn    3;

valueLabel    6;

valueName     "T";

gradientLabel    7;

gradientSize     2;

gradientName     "gradT";

mapMethod       interp1; //#nearest

boundary
{
	freeSurf	    "save_line_melt_surf.dat";
    // crysInter	    "save_line_melt_crys.dat";
    crucibleSide	"save_line_crc_melt.dat";
    crucibleBot	    "save_line_crc_melt.dat";
}
